export const employees = {
  entp: [
    { name: '소희' },
    { name: '승호' },
    { name: '민관' },
    { name: '창모' },
    { name: '정배' },
    { name: '수현' }
  ],
  enfj: [
    { name: '현서' },
    { name: '민보' },
    { name: '기찬' },
    { name: '강현' }
  ],
  enfp: [
    { name: '상운' },
    { name: '성빈' },
    { name: '경수' },
    { name: '지영' },
    { name: '원재' }
  ],
  entj: [
    { name: '윤정' },
    { name: '현석' },
    { name: '민주' }
  ],
  estj: [
    { name: '현' },
    { name: '민성' }
  ],
  estp: [
    { name: '병국' }
  ],
  infj: [
    { name: '오종' },
    { name: '희곤' },
    { name: '보라' },
    { name: '진용' }
  ],
  infp: [
    { name: '재훈' },
    { name: '원호' },
    { name: '도영' },
    { name: '태웅' },
    { name: '준기' }
  ],
  intj: [
    { name: '성환' },
    { name: '지원' },
    { name: '시안' },
    { name: '채현김' },
    { name: '성준' },
    { name: '용석' },
    { name: '성일' }
  ],
  intp: [
    { name: '병필' },
    { name: '채현강' },
    { name: '가연' },
    { name: '현진' },
    { name: '수민' }
  ],
  isfj: [
    { name: '원형' },
    { name: '현희' },
    { name: '현덕' },
    { name: '덕연' },
    { name: '영진' }
  ],
  isfp: [
    { name: '완식' },
    { name: '혜강' },
    { name: '강희' }
  ],
  istj: [
    { name: '문호' },
    { name: '수현' },
    { name: '광수' },
    { name: '윤철' }
  ],
  istp: [
    { name: '진수' },
    { name: '시춘' },
    { name: '승렬' }
  ],
  mola: [
    { name: '민수' },
    { name: '경민' },
    { name: '현식' },
    { name: '유현' },
    { name: '정범' },
    { name: '영주' },
    { name: '낙훈' },
    { name: '주홍' }
  ]
};

export const mbtiMessages = {
  entp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  enfj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  enfp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  entj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  estj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  estp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  infj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  infp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  intj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  intp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  isfj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  isfp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  istj: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  istp: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~',
  mola: '개꿀잼 각? 갑작스러운 상황 좋아. 가보자~'
};

export const sampleQuestions = [
  '"자유롭게 의견 주세요"라고 하면 말이 많아지는 MBTI vs 갑자기 조용해지는 MBTI.',
  '회의가 길어질 때 가장 빨리 눈빛이 죽는 MBTI는?',
  '회사에 노조가 생긴다면, 위원장을 맡을 가능성이 가장 높은 MBTI는?',
  '생일 축하 메시지 슬랙 보낼 때 가장 정성스럽게 쓰는 MBTI는?'
];

export const companyMBTI = {
  type: 'INTJ',
  description: `나, 솔박스는 INTJ야. 나는 감으로 움직이지 않아.
모든 일엔 이유가 있고, 그 이유엔 근거가 있어.데이터를 보고, 흐름을 읽고, 그다음에야 움직이지.

"이 선택이 장기적으로 어떤 결과를 만들까?" 이 질문이 내 하루를 움직여.내 안엔 "더 나은 방법"을 향한 열정이 꽉 차 있어.

결국 내가 하고 싶은 건 하나야. 계획된 혁신으로 세상을 더 효율적으로 바꾸는 것.

그게 바로, 나 솔박스의 방식이야.`,
  stats: {
    EI: { E: 48, I: 52 },
    NS: { N: 51, S: 49 },
    TF: { T: 55, F: 45 },
    PJ: { P: 50, J: 50 }
  }
};
